app/Services/DataTableService.php

SELECT *
FROM `products`
---
    protected function getProductTable(): DataTable
    {
        $model = new ProductModel();
        $query = $model->findAll();

SELECT *
FROM `target`
---
    protected function getTargetTable(): DataTable
    {
        $model = new TargetModel();
        $query = $model->findAll();