app/Controllers/VisitPipeline.php

SELECT `id`, `name`, `potential`, `address`
FROM `pipelines`
WHERE `id` = '27'
 LIMIT 1
---
    public function getPipelineDetails($id)
    {
        if (!is_numeric($id)) {
            return $this->response->setJSON(['error' => 'Invalid ID'], 400);
        }

        $pipeline = $this->pipelineModel
            ->select('id, name, potential, address')
            ->where('id', $id)
            ->first();