app/Models/ActualModel.php

SELECT `actual`.`id`, `actual`.`id_fso`, `visit_pipelines`.`id` AS `visitpipeline_id`, `pipelines`.`name` AS `pipeline_name`, `actual`.`branch_code`, `actual`.`product_id`, `actual`.`acc_number`, `actual`.`actual`, `actual`.`month`, `actual`.`timestamp`
FROM `actual`
LEFT JOIN `visit_pipelines` ON `visit_pipelines`.`id` = `actual`.`visitpipeline_id`
LEFT JOIN `pipelines` ON `pipelines`.`id` = `visit_pipelines`.`pipeline_id`
WHERE `visit_pipelines`.`status_closing` = 1
---
    public function getAllDataWithPipeline()
    {
        return $this->select([
            'actual.id',
            'actual.id_fso',
            'visit_pipelines.id AS visitpipeline_id',
            'pipelines.name AS pipeline_name',
            'actual.branch_code',
            'actual.product_id',
            'actual.acc_number',
            'actual.actual',
            'actual.month',
            'actual.timestamp'
        ])
            ->join('visit_pipelines', 'visit_pipelines.id = actual.visitpipeline_id', 'left')
            ->join('pipelines', 'pipelines.id = visit_pipelines.pipeline_id', 'left')
            ->where('visit_pipelines.status_closing', 1) // ✅ Tambahkan kondisi status = 1
            ->findAll();