app/Models/ProductModel.php

SELECT `id`, `name`, `description`, `timeline`, `created_by`, `status`
FROM `products`
WHERE `status` = 1
ORDER BY `name` ASC
---
    public function getAllProducts()
    {
        return $this->select('id, id_product, name, description, status')
            ->where('status', 1)  // Hanya produk aktif
            ->orderBy('name', 'ASC')  // Urutkan berdasarkan nama
            ->findAll();

SELECT `id`, `id_product`, `name`
FROM `products`
WHERE `status` = 1
ORDER BY `name` ASC
---
    public function getProductDropdown()
    {
        return $this->select('id, id_product, name')
            ->where('status', 1)  // Hanya produk aktif
            ->orderBy('name', 'ASC')
            ->findAll();