app/Models/VisitPipelineModel.php

SELECT `pipelines`.`id`, `pipelines`.`name`
FROM `visit_pipelines`
JOIN `pipelines` ON `pipelines`.`id` = `visit_pipelines`.`pipeline_id`
WHERE `visit_pipelines`.`status_closing` = 1
GROUP BY `pipelines`.`id`, `pipelines`.`name`
---
    public function getClosedPipelineCustomers()
    {
        return $this->db->table('visit_pipelines')
            ->select('pipelines.id, pipelines.name')
            ->join('pipelines', 'pipelines.id = visit_pipelines.pipeline_id')
            ->where('visit_pipelines.status_closing', 1)
            ->groupBy('pipelines.id, pipelines.name') // Hindari duplikat
            ->get()
            ->getResultArray();